// 주석
// 컴퓨터가 무시하는 메세지
// 주로 코드를 설명할 때 사용한다.
// 주석이 많은 코드 보다 적은 코드가 좋다. (코드가 어렵고 길어지면 주석이 많아진다.)


// 윈도우: ctrl + /
// 맥: command + /

// 한 줄 짜리 주석
console.log("주석"); // 이렇게 코드 옆에 다는 것도 가능

/* 주석은 여러줄에 걸쳐

console.log('찍힘');
console.log('찍힘');

사용 할 수 있고 코드를 임시로 사용하지 않을 때 주석처리를 할 수 있다.
*/

// 세미콜론
console.log("주석")
// 한줄 끝에는 세미콜론을 붙이지 않아도 실행이 되지만
// 여러줄을 한번에 쓸 때는 세미콜론을 붙여야 한다.
// console.log("주석")console.log("주석")  오류발생
console.log("주석"); console.log("주석"); // 이렇게는 가능

